Examinator/src/Catalogs/ФреймыСУЗ/ФреймыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФреймыСУЗ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <comment>Хранится краткое имя макета как оно задано в синониме перечисления</comment>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СлотыФреймаСУЗ/СлотыФреймаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СлотыФреймаСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ФреймыСУЗ</owners>
  <attributes>
    <name>ВидХарактеристики</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.пФреймыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеХарактеристики</name>
    <type>
      <types>Characteristic.пФреймыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/ФреймыСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.frame;
	
КонецФункции

// Позволяет получить XML данные объекта.
//
// Параметры
//  ОбъектСУЗ          - экземпляр обработки ОбъектСУЗ.
//  ПараметрыСсылки    – Структура, содержит параметры ссылки по которой вызывается вопрос.
//  КонтекстВыполнения - Структура, содержит параметры контекста выполнения объекта.
//
// Возвращаемое значение:
//   Строка – содержит XML представление объекта СУЗ.
//
Функция ПолучитьXMLПредставление(Фрейм, ПараметрыСсылки, КонтекстВыполнения) Экспорт
	
	ИмяОбъектаСУЗ = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
	
	XMLДанные = "<ОбъектСУЗ>";
	XMLДанные = XMLДанные + "<Фрейм object="""+ИмяОбъектаСУЗ+"""
										|id="""+Фрейм.УникальныйИдентификатор()+""">";
										

	XMLДанные = XMLДанные + "<Наименование><![CDATA[" + Фрейм.Наименование + "]]></Наименование>";
	
	XMLДанные = XMLДанные + "<Характеристики>";
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СлотыФреймаСУЗ.Ссылка КАК Ссылка,
	|	СлотыФреймаСУЗ.Код КАК Код,
	|	СлотыФреймаСУЗ.ЗначениеХарактеристики,
	|	СлотыФреймаСУЗ.ЭтоГруппа,
	|	СлотыФреймаСУЗ.Наименование,
	|	СлотыФреймаСУЗ.ВидХарактеристики.Формат КАК Формат
	|ИЗ
	|	Справочник.СлотыФреймаСУЗ КАК СлотыФреймаСУЗ
	|ГДЕ
	|	СлотыФреймаСУЗ.Владелец = &Фрейм
	|   И СлотыФреймаСУЗ.ПометкаУдаления = &ПометкаУдаления 
    |
	|УПОРЯДОЧИТЬ ПО
	|	Код ИЕРАРХИЯ
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Фрейм", Фрейм);
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПредыдущийУровеньВВыборке = -1;
	ЕстьСледОбъект = Ложь;
	СформироватьХарактеристику(Выборка, ЕстьСледОбъект, ПредыдущийУровеньВВыборке, XMLДанные, ПараметрыСсылки, КонтекстВыполнения);
	
	XMLДанные = XMLДанные + "</Характеристики>";
	
	XMLДанные = XMLДанные + Символы.ПС + "</Фрейм>";
	XMLДанные = XMLДанные + Символы.ПС + "</ОбъектСУЗ>";
	
	ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Фрейм);
	ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
	
	Возврат XMLДанные;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура СформироватьХарактеристику(Выборка, ЕстьСледОбъект, ПредыдущийУровеньВВыборке, XMLДанные, ПараметрыСсылки, КонтекстВыполнения)

		ЕстьСледОбъект = Выборка.Следующий();
		НомерЭлементаВГруппе = 0;
		
		Пока ЕстьСледОбъект Цикл
			
			ТекущийУровеньВВыборке = Выборка.Уровень();
			
			Если ТекущийУровеньВВыборке <= ПредыдущийУровеньВВыборке Тогда
				Прервать; // Возвращаемся на предыдущий уровень Рекурсии.
			КонецЕсли;
			
			НомерЭлементаВГруппе = НомерЭлементаВГруппе + 1;
			
			Попытка
				ВыборкаЭтоГруппа = Выборка.ЭтоГруппа;
			Исключение
				ВыборкаЭтоГруппа = Ложь;
			КонецПопытки;
			
			XMLДанные = XMLДанные + "<Характеристика 
													|УровеньВВыборке="""+ ТекущийУровеньВВыборке +""" 
													|НомерЭлементаВГруппе="""+ НомерЭлементаВГруппе +""" 
													|ЭтоГруппа="""+ ВыборкаЭтоГруппа +""">";
													
			XMLДанные = XMLДанные + "<Наименование>"+ Выборка.Наименование +"</Наименование>";
			
			Если ВыборкаЭтоГруппа Тогда
				
				СформироватьХарактеристику(Выборка, ЕстьСледОбъект, ТекущийУровеньВВыборке, XMLДанные, ПараметрыСсылки, КонтекстВыполнения);
				XMLДанные = XMLДанные + "</Характеристика>";
				Продолжить;
				
			Иначе
				
				ТипХарактеристики = ТипЗнч(Выборка.ЗначениеХарактеристики);
				
				Если ТипХарактеристики = Тип("Дата") ИЛИ
					ТипХарактеристики = Тип("Число") ИЛИ
					ТипХарактеристики = Тип("Булево") Тогда
					XMLДанные = XMLДанные + "<Представление>";
					XMLДанные = XMLДанные + Формат(Выборка.ЗначениеХарактеристики, Выборка.Формат);
					XMLДанные = XMLДанные + "</Представление>";
				КонецЕсли;
				
				Если ТипХарактеристики = Тип("Строка") Тогда
					XMLДанные = XMLДанные + "<Представление>";
					XMLДанные = XMLДанные + Выборка.ЗначениеХарактеристики;				
					XMLДанные = XMLДанные + "</Представление>";
				КонецЕсли;
				
				Если СтрЧислоВхождений(Строка(ТипХарактеристики), "Справочник ссылка" ) > 0 Тогда
					
					ОбъектСправочника = Выборка.ЗначениеХарактеристики;
					
					СтруктураДанныхОбъектаСУЗ = ОбъектыСУЗ.ПолучитьПредставление(Выборка.ЗначениеХарактеристики, ПараметрыСсылки, КонтекстВыполнения);
					
					XMLДанные = XMLДанные + "<Представление><![CDATA["+ 
					                        СтруктураДанныхОбъектаСУЗ.Представление
											+"]]></Представление>";
											
					XMLДанные = XMLДанные + "<Скрипт><![CDATA["+
					                        СтруктураДанныхОбъектаСУЗ.Скрипт
											+"]]></Скрипт>";
					
				КонецЕсли;
				
				XMLДанные = XMLДанные + "</Характеристика>";
				ЕстьСледОбъект = Выборка.Следующий();
				
			КонецЕсли;
			
			
		КонецЦикла;
	
	
КонецПроцедуры

#КонецЕсли
